# TagNoBreakParamStrings Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TagNoBreakParamStrings Property
ParameterTypeId Class See Also
---
"Wrap between parameters only"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TagNoBreakParamStrings { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TagNoBreakParamStrings As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TagNoBreakParamStrings {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace